Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: See also: mysql_get_client_info(), mysql_get_proto_info() and mysql_get_server_info().
pt_br: Veja também: mysql_get_client_info(), mysql_get_proto_info() e mysql_get_server_info().

source: mysql_get_proto_info() returns the protocol version used by connection link_identifier.
pt_br: mysql_get_proto_info() retorna a versão do protocolo usada pela conexão link_identifier.

source: Example 1. mysql_get_proto_info Example
pt_br: Exemplo mysql_get_proto_info

source: ?php mysql_connect( "localhost", "mysql_user", "mysql_password") or die("Could not connect: ". mysql_error()); printf ("MySQL protocol version: %s\n", mysql_get_proto_info());?
pt_br: ?php mysql_connect( "localhost", "mysql_user", "mysql_password") or die("Não pude conectar: ". mysql_error()); printf ("MySQL protocol version: %s\n", mysql_get_proto_info());?

source: See also: mysql_get_client_info(), mysql_get_host_info() and mysql_get_server_info().
pt_br: Veja também: mysql_get_client_info(), mysql_get_host_info() and mysql_get_server_info().

source: mysql_get_server_info() returns the server version used by connection link_identifier.
pt_br: mysql_get_server_info() retorna a versão do servidor usado para a conexão link_identifier.

source: Example 1. mysql_get_server_info Example
pt_br: Exemplo mysql_get_server_info

source: ?php mysql_connect( "localhost", "mysql_user", "mysql_password") or die("Could not connect: ". mysql_error()); printf ("MySQL server version: %s\n", mysql_get_server_info());?
pt_br: ?php mysql_connect( "localhost", "mysql_user", "mysql_password") or die("Não pude conectar: ". mysql_error()); printf ("MySQL server version: %s\n", mysql_get_server_info());?

source: See also: mysql_get_client_info(), mysql_get_host_info() and mysql_get_proto_info().
pt_br: Veja também: mysql_get_client_info(), mysql_get_host_info() e mysql_get_proto_info().

source: mysql_info() returns detailed information about the last query using the given link_identifier.
pt_br: mysql_info() retorna informação detalhada sobre a última query usando o link_identifier dado.

source: If link_identifier isn 't specified, the last opened link is assumed.
pt_br: Se link_identifier não é especificado, a última conexão aberta é usada.

source: mysql_info() returns a string for all statements listed below.
pt_br: mysql_info() retorna uma string para todos os itens listados abaixo.

source: For all other FALSE.
pt_br: Para todos os outros FALSE.

source: The string format depends on the given statement.
pt_br: O formato da string depende do comando dado.

source: Relevant MySQL Statements
pt_br: Comandos Importantes do MySQL

source: VALUES statement only if multiple value lists are specified in the statement.
pt_br: VALUES somente se multiplas listas de valores são especificadas no comando.

source: See also: mysql_affected_rows()
pt_br: Veja também: mysql_affected_rows()

source: mysql_insert_id() returns the ID generated for an AUTO_INCREMENT column by the previous INSERT query using the given link_identifier.
pt_br: mysql_insert_id() returna o ID gerado para um campo AUTO_INCREMENT pela ultima query INSERT usando o link_identifier mysql_insert_id() returna o ID gerado para um campo AUTO_INCREMENT pela ultima query INSERT usando o link_identifier dado.

source: mysql_insert_id() returns 0 if the previous query does not generate an AUTO_INCREMENT value.
pt_br: mysql_insert_id() retorna 0 se a query anterior não gerou um valor AUTO_INCREMENT.

source: If you need to save the value for later, be sure to call mysql_insert_id() immediately after the query that generates the value.
pt_br: Se você precisa salvar o valor para depois, tenha certeza de chamar mysql_insert_id() imediatamente depois da query que gerou o valor.

source: The value of the MySQL SQL function LAST_INSERT_ID() always contains the most recently generated AUTO_INCREMENT value, and is not reset between queries.
pt_br: O valor da função SQL do MySQL LAST_INSERT_ID() sempre contém o mais recente valor AUTO_INCREMENT gerado, e não é reiniciado entre as query.

source: mysql_insert_id() converts the return type of the native MySQL C API function mysql_insert_id() to a type of long (named int in PHP).
pt_br: mysql_insert_id() converte o tipo de retorno nativo do MySQL C API mysql_insert_id() para o tipo long (nomeado int no PHP).

source: If your AUTO_INCREMENT column has a column type of BIGINT, the value returned by mysql_insert_id() will be incorrect.
pt_br: Se a sua coluna AUTO_INCREMENT tem um tipo BIGINT, o valor retornado por mysql_insert_id() será incorreto.

source: Instead, use the internal MySQL SQL function LAST_INSERT_ID() in an SQL query.
pt_br: Ao invés, use a função interna SQL do MySQL LAST_INSERT_ID() numa query SQL.

source: Example 1. mysql_insert_id Example
pt_br: Exemplo mysql_insert_id

source: ?php mysql_connect( "localhost", "mysql_user", "mysql_password") or die("Could not connect: ". mysql_error()); mysql_select_db("mydb"); mysql_query("INSERT INTO mytable (product) values ('kossu')"); printf ("Last inserted record has id %d\n", mysql_insert_id());?
pt_br: ?php mysql_connect( "localhost", "mysql_user", "mysql_password") or die("Não pude conectar: ". mysql_error()); mysql_select_db("mydb"); mysql_query("INSERT INTO mytable (product) values ('kossu')"); printf ("O ultimo registro incluído tem id %d\n", mysql_insert_id());?

source: See also: mysql_query().
pt_br: Veja também: mysql_query().

source: mysql_list_dbs() will return a result pointer containing the databases available from the current mysql daemon.
pt_br: mysql_list_dbs() irá retorna um ponteiro de resultado contendo os bancos de dados disponiveis do servidor MySQL atual.

source: Use the mysql_tablename() function to traverse this result pointer, or any function for result tables.
pt_br: Use a função mysql_tablename() para atravessar este ponteiro de resultado, ou qualquer função para o resultado das tabelas.

source: Example 1. mysql_list_dbs() example
pt_br: Exemplo mysql_list_dbs()

source: The above code would just as easily work with mysql_fetch_row() or other similar functions.
pt_br: O codigo acima trabalha facil com mysql_fetch_row() ou outras funções similares.

source: For downward compatibility mysql_listdbs() can also be used.
pt_br: Para compatibilidade com as versões anteriores mysql_listdbs() também pode ser usada.

source: This is deprecated however.
pt_br: Esta função esta depreciada.

source: See also mysql_db_name().
pt_br: Veja também mysql_db_name().

source: mysql_list_fields() retrieves information about the given table name.
pt_br: mysql_list_fields() retorna informação sobre a tabela dada.

source: Arguments are the database name and the table name.
pt_br: Os argumentos são o nome do banco de dados e da tabela.

source: A result pointer is returned which can be used with mysql_field_flags(), mysql_field_len(), mysql_field_name(), and mysql_field_type().
pt_br: Um ponteiro de resultado é retornado o qual pode ser usado com mysql_field_flags(), mysql_field_len(), mysql_field_name(), e mysql_field_type().

source: Example 1. mysql_list_fields() example
pt_br: Exemplo mysql_list_fields()

source: For downward compatibility mysql_listfields() can also be used.
pt_br: Para compatibilidade com versões anteriores mysql_listfields() também pode ser usada.

source: mysql_list_processes() returns a result pointer describing the current server threads.
pt_br: mysql_list_processes() retorna um ponteiro de resultado descrevendo as threads atuais do servidor.

source: Example 1. mysql_list_processes() example
pt_br: Exemplo mysql_list_processes()

source: See also: mysql_thread_id()
pt_br: Veja também: mysql_thread_id()

source: mysql_list_tables() takes a database name and returns a result pointer much like the mysql_query() function.
pt_br: mysql_list_tables() leva o nome de um banco de dados e retorna um ponteiro de resultado muito parecido com a função mysql_query().

source: You can use the mysql_tablename() function to extract the actual table names from the result pointer, or any other result table function such as mysql_fetch_assoc().
pt_br: Você pode usar a função mysql_tablename() para extrair os nomes atuais das tabela do ponteiro do resultado, ou qualquer outra função com o resultado de tabela como mysql_fetch_assoc().

source: The database parameter is the name of the database to retrieve the list of tables from.
pt_br: O parametro database é o nome do banco de dados de onde obter a lista de tabelas.

source: Upon failure, mysql_list_tables() returns FALSE.
pt_br: Se a função mysql_list_tables() falhar, retorna FALSE.

source: For downward compatibility, the function alias named mysql_listtables() can be used.
pt_br: Para compatibilidade com versões anteriores, o apelido chamado mysql_listtables() pode ser usado.

source: This is deprecated however and is not recommended.
pt_br: Esta depreciada e seu uso não é recomendado.

source: Example 1. mysql_list_tables Example
pt_br: Exemplo mysql_list_tables

source: ?php $dbname = 'mysql_dbname'; if (!mysql_connect('mysql_host', 'mysql_user', 'mysql_password')) {print'Could not connect to mysql'; exit;} $result = mysql_list_tables($dbname); if (!$result) {print "DB Error, could not list tables\n"; print'MySQL Error:'. mysql_error(); exit;} while ($row = mysql_fetch_row($result)) {print "Table: $row[0]\n";} mysql_free_result($result);?
pt_br: ?php $dbname = 'mysql_dbname'; if (!mysql_connect('mysql_host', 'mysql_user', 'mysql_password')) {print 'Não pude conectar com o MySQL'; exit;} $result = mysql_list_tables($dbname); if (!$result) {print "DB Error, não pude listar as tabelas\n"; print 'MySQL Error:'. mysql_error(); exit;} while ($row = mysql_fetch_row($result)) {print "Table: $row[0]\n";} mysql_free_result($result);?

source: See also: mysql_list_dbs(), and mysql_tablename().
pt_br: Veja também: mysql_list_dbs(), e mysql_tablename().

source: mysql_num_fields() returns the number of fields in a result set.
pt_br: mysql_num_fields() retorna o número de campos em um conjunto de resultado.

source: See also: mysql_select_db(), mysql_query(), mysql_fetch_field(), mysql_num_rows().
pt_br: Veja também: mysql_select_db(), mysql_query(), mysql_fetch_field(), mysql_num_rows().

source: For downward compatibility mysql_numfields() can also be used.
pt_br: Para compatibilidade com versões anteriores mysql_numfields() também pode ser usada.

source: mysql_num_rows() returns the number of rows in a result set.
pt_br: Descrição

source: This command is only valid for SELECT statements.
pt_br: mysql_num_rows() retorna o número de linhas em um resultado.

source: To retrieve the number of rows affected by a INSERT, UPDATE or DELETE query, use mysql_affected_rows().
pt_br: Para obter o número de linhas afetadas por INSERT, UPDATE ou DELETE, use mysql_affected_rows().

source: Example 1. mysql_num_rows() example
pt_br: Exemplo mysql_num_rows()

source: If you use mysql_unbuffered_query(), mysql_num_rows() will not return the correct value until all the rows in the result set have been retrieved.
pt_br: Se você usar mysql_unbuffered_query(), mysql_num_rows() não irá retornar o valor correto até que todas as linhas do resultado sejam obtidas.

source: See also: mysql_affected_rows(), mysql_connect(), mysql_data_seek(), mysql_select_db(), and mysql_query().
pt_br: Veja também: mysql_affected_rows(), mysql_connect(), mysql_data_seek(), mysql_select_db(), e mysql_query().

source: For downward compatibility mysql_numrows() can also be used.
pt_br: Para compatibilidade com versões anteriores mysql_numrows() também pode ser usada.

source: Returns a positive MySQL persistent link identifier on success, or FALSE on error.
pt_br: Retorna um identificador de link persistente ao MySQL em caso de sucesso, ou FALSE se houver erro.

source: mysql_pconnect() establishes a connection to a MySQL server.
pt_br: mysql_pconnect() estabelece uma conexão com o servidor MySQL.

source: Support for ":port" was added in 3.0B4.
pt_br: Suporte a ":port" foi adicionado em 3.0B4.

source: Support for the ": / path / to / socket" was added in 3.0.10.
pt_br: Suporte a ": / path / to / socket" foi adicionado em 3.0.10.

source: mysql_pconnect() acts very much like mysql_connect() with two major differences.
pt_br: mysql_pconnect() aje muito parecido com mysql_connect() com duas maiores diferenças.

source: Instead, the link will remain open for future use (mysql_close() will not close links established by mysql_pconnect()).
pt_br: Ao invés, a conexão continuará aberta para uso futuro( mysql_close() não irá fechar conexões abertas por mysql_pconnect()).

source: The optional client_flags parameter became available in PHP 4.3.0.
pt_br: O parametro opcional client_flags tornou-se disponivel no PHP 4.3.0.

source: This type of link is therefore called 'persistent'.
pt_br: Este tipo de conexão é portanto chamada 'persistente'.

source: Note, that these kind of links only work if you are using a module version of PHP.
pt_br: Note que este tipo de conexão funciona somente se você esta usando o PHP como módulo.

source: See the Persistent Database Connections section for more information.
pt_br: Veja a seção Persistent Database Connections para maiores informações.

source: Using persistent connections can require a bit of tuning of your Apache and MySQL configurations to ensure that you do not exceed the number of connections allowed by MySQL.
pt_br: Usar conexões persistentes pode requerer alguns ajustes na sua configuração do Apache e MySQL para assegurar que você não ultrapasse o limite de conexões permitidos pelo MySQL.

source: mysql_ping() checks whether or not the connection to the server is working.
pt_br: Descrição

source: If it has gone down, an automatic reconnection is attempted.
pt_br: mysql_ping() confere se uma conexão com o servidor esta ou não funcionando.

source: This function can be used by scripts that remain idle for a long while, to check whether or not the server has closed the connection and reconnect if necessary. mysql_ping() returns TRUE if the connection to the server is working, otherwise FALSE.
pt_br: Esta função pode ser usada por scripts que permanecem ociosos por um grande tempo, para conferir uqando o servidor fechou ou não a conexão e reconectar se necessário. mysql_ping() returna TRUE se a conexão com o servidor esta funcionando, em outro caso FALSE.

source: See also: mysql_thread_id(), mysql_list_processes().
pt_br: Veja também: mysql_thread_id(), mysql_list_processes().

source: mysql_query() sends a query to the currently active database on the server that's associated with the specified link identifier.
pt_br: mysql_query() envia uma query para o banco de dados ativo no servidor da conexão informada em link_identifier.

source: If no link is open, the function tries to establish a link as if mysql_connect() was called with no arguments, and use it.
pt_br: Se nenhuma conexão esta aberta, a função tenta estabelecer uma conexão como mysql_connect() seja chamada sem argumentos e usa-a.

source: The optional result_mode parameter can be MYSQL_USE_RESULT and MYSQL_STORE_RESULT.
pt_br: O parâmetro opcional result_mode pode ser MYSQL_USE_RESULT e MYSQL_STORE_RESULT.

source: It defaults to MYSQL_STORE_RESULT, so the result is buffered.
pt_br: O seu padrão MYSQL_STORE_RESULT, assim seu resultado é colocado no buffer.

source: See also mysql_unbuffered_query() for the counterpart of this behaviour.
pt_br: Veja também mysql_unbuffered_query() para a sua contrapartida.

source: The query string should not end with a semicolon.
pt_br: A string da query não deve terminar com ponto e virgula(;).

source: Only for SELECT,SHOW,EXPLAIN or DESCRIBE statements mysql_query() returns a resource identifier or FALSE if the query was not executed correctly.
pt_br: Somente para os comandos SELECT, SHOW, EXPLAIN ou DESCRIBE mysql_query() retorna um identificador de recurso ou FALSE se a query não foi executada corretamente.

source: For other type of SQL statements, mysql_query() returns TRUE on success and FALSE on error.
pt_br: Para outros tipos de comandos SQL, mysql_query() retorna TRUE em caso de sucesso e FALSE em erro.

source: A non - FALSE return value means that the query was legal and could be executed by the server.
pt_br: Um valor não FALSE indica que a query foi legal e pode ser executada pelo servidor.

source: It does not indicate anything about the number of rows affected or returned.
pt_br: Não indica nada sobre o número de linhas afetadas ou retornadas.

source: It is perfectly possible for a query to succeed but affect no rows or return no rows.
pt_br: É perfeitamente possível para uma query ser bem sucedida, mas não afetar linhas ou retornar linhas.

source: The following query is syntactically invalid, so mysql_query() fails and returns FALSE:
pt_br: A seguinte query é sintaticamente invalida, assim mysql_query() falha e retorna FALSE:

source: Example 1. mysql_query()
pt_br: Exemplo 1. mysql_query()

source: php $result = mysql_query( "SELECT * WHERE 1=1") or die("Invalid query: ". mysql_error());?
pt_br: php $result = mysql_query( "SELECT * WHERE 1=1") or die("Query invalida: ". mysql_error());?

source: The following query is semantically invalid if my_col is not a column in the table my_tbl, so mysql_query() fails and returns FALSE:
pt_br: A seguinte query é semanticamente invalida se my_col não é uma coluna da tabela my_tbl, assim mysql_query() falha e retorna FALSE:

source: Example 2. mysql_query()
pt_br: Exemplo 2. mysql_query()

source: ?php $result = mysql_query( "SELECT my_col FROM my_tbl") or die("Invalid query: ". mysql_error());?
pt_br: ?php $result = mysql_query( "SELECT my_col FROM my_tbl") or die ("Query invalida: ". mysql_error());?

source: mysql_query() will also fail and return FALSE if you don't have permission to access the table(s) referenced by the query.
pt_br: mysql_query() irá também falhar e retornar FALSE se você não tiver permissão para acessar a tabela(s) referida(s) pela query.

source: Assuming the query succeeds, you can call mysql_num_rows() to find out how many rows were returned for a SELECT statment or mysql_affected_rows() to find out how many rows were affected by a DELETE, INSERT, REPLACE, or UPDATE statement.
pt_br: Assumindo que a query seja bem sucedida, você pode chamar mysql_num_rows() para achar quantas linhas foram retornadas para um comando SELECT ou mysql_affected_rows() para achar quantas linhas foram afetadas por um comando DELETE, INSERT, REPLACE, ou UPDATE.

source: Only for SELECT,SHOW,DESCRIBE or EXPLAIN statements, mysql_query() returns a new result identifier that you can pass to mysql_fetch_array() and other functions dealing with result tables.
pt_br: Somente para os comandos SELECT,SHOW,DESCRIBE ou EXPLAIN, mysql_query() retorna um novo identificador de resultado que você pode passar para mysql_fetch_array() e outras funções que lidam com resultados de tabelas.

source: When you are done with the result set, you can free the resources associated with it by calling mysql_free_result().
pt_br: Quando você terminou de usar o resultado você pode liberar os recursos usados chamando mysql_free_result().

source: Although, the memory will automatically be freed at the end of the script 's execution.
pt_br: Embora a memória será automaticamente liberada ao final da execução do script.

source: See also: mysql_num_rows(), mysql_affected_rows(), mysql_unbuffered_query(), mysql_free_result(), mysql_fetch_array(), mysql_fetch_row(), mysql_fetch_assoc(), mysql_result(), mysql_select_db(), and mysql_connect().
pt_br: Veja também: mysql_num_rows(), mysql_affected_rows(), mysql_unbuffered_query(), mysql_free_result(), mysql_fetch_array(), mysql_fetch_row(), mysql_fetch_assoc(), mysql_result(), mysql_select_db(), and mysql_connect().

source: This function will escape special characters in the unescaped_string, taking into account the current charset of the connection so that it is safe to place it in a mysql_query().
pt_br: Esta função irá escapar os caracteres especiais em unescaped_string, levando em conta o atual conjunto de caracteres da conexão, assim é seguro coloca-la em mysql_query().

source: Example 1. mysql_real_escape_string() example
pt_br: Exemplo mysql_real_escape_string()

source: See also: mysql_escape_string(), mysql_character_set_name().
pt_br: Veja também: mysql_escape_string(), mysql_character_set_name().

source: mysql_result() returns the contents of one cell from a MySQL result set.
pt_br: mysql_result() retorna o conteúdo de uma célula do resultado MySQL.

source: The field argument can be the field' s offset, or the field's name, or the field's table dot field name (tablename.fieldname).
pt_br: O argumento field( campo) pode ser o índice do campo, o nome do campo, o a tabela ponto o nome do campo(tabela.campo).

source: If the column name has been aliased ('select foo as bar from.. .'), use the alias instead of the column name.
pt_br: Se o nome da coluna usa apelido ('select foo as bar from.. .'), use o apelido ao invés do nome da coluna.

source: As these functions return the contents of multiple cells in one function call, they' re MUCH quicker than mysql_result().
pt_br: Estas funções retornam o conteúdo de multiplas células em uma chamada de função, elas são MUITO mais rapidas do que mysql_result().

source: Calls to mysql_result() should not be mixed with calls to other functions that deal with the result set.
pt_br: Chamadas a mysql_result() não devem ser misturadas com chamadas a outras funções que lidam com o conjunto de resultados.

source: Recommended high-performance alternatives: mysql_fetch_row(), mysql_fetch_array(), and mysql_fetch_object().
pt_br: Alternativas de alta performance recomendadas: mysql_fetch_row(), mysql_fetch_array(), e mysql_fetch_object().

source: mysql_select_db() sets the current active database on the server that's associated with the specified link identifier.
pt_br: mysql_select_db() define o banco de dados ativo no servidor que é associado ao identificador de conexão(link_identifier) especificado.

source: If no link is open, the function will try to establish a link as if mysql_connect() was called without arguments, and use it.
pt_br: Se nenhuma conexão esta aberta, a função irá tentar abrir uma conexão como se mysql_connect() fosse chamada sem argumentos e usa-la.

source: Every subsequent call to mysql_query() will be made on the active database.
pt_br: todas as próximas chamadas a mysql_query() serão feitas no banco de dados ativo.

source: See also: mysql_connect(), mysql_pconnect(), and mysql_query().
pt_br: Veja também: mysql_connect(), mysql_pconnect(), e mysql_query().

source: For downward compatibility mysql_selectdb() can also be used.
pt_br: Para compatibilidade com versões anteriores mysql_selectdb() também pode ser usada.

source: mysql_stat() returns the current server status.
pt_br: Descrição

source: For a complete list of other status variables you have to use the SHOW STATUS SQL command.
pt_br: Para uma lista completa de outras variáveis de staus você tem que usar o comando SQL SHOW STATUS.

source: Example 1. mysql_stat() example
pt_br: Exemplo mysql_stat()

source: The mysql_num_rows() function may be used to determine the number of tables in the result pointer.
pt_br: mysql_tablename() usa um ponteiro de resultado retornado por mysql_list_tables() ou um índice inteiro e retorna o nome da tabela A função mysql_num_rows() pode ser usada para determinar o número de tabelas no ponteiro do resultado.

source: Example 1. mysql_tablename() Example
pt_br: Exemplo mysql_tablename()

source: See also: mysql_list_tables().
pt_br: Veja também: mysql_list_tables().

source: mysql_thread_id() returns the current thread ID.
pt_br: Descrição
